node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 1370178
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\266Zi\276\237\357\342=\261\361\343<\t\033\211\274j\270;\276/%5\274\n\r\353=\234\256I>w\243Q>9\362\223\276\227N\363;\027\023\342\275\220+\225>\2631#\275f\342\250=2I\004\274\017\233L\276\246~$\276O\210\220\275\327e\252:E\021\035>\"\324\004\274!\333B\275\022\2154\275\343\300\315\275\2600J\275<S\215\276\301\032\340\275@\246\226\275T\\F\276 \257\023>\2630\311=G+\270\275\224\307\300<p)\007>\374\235\240=\326\221\252\273\001\275\245=\315\315\253\274`\3436\276$\344E=\351\247;=\210\262E\275l\244~=\237\353\032\276\345`^\2753\272\316\273\300!\202\275=\377/\276\273z\000>l1\253=\241\"&\275\0252\376\274U\342\203\276tF\215\275P>\327=\273\027\031\276\316gr\274;Y\212>\224\255\014=\r6\023>\014\234y\275\023\035\253\275\013M{\274\244\365\301\275\235\273*=rP\000\276\221\260\320\274\252\005U\275\363\216h\276v6\303\274]\324x\274\327\370 =\252C\"\276)\344\342=\353(\343<\022x\t\276c\243\311=\217\377\235\275k\002\">\217\006 <\206\276N>\234\034a>\262\275\301=\351\262\237<4\265\255\274\024vd\276\247\245\325=Z\236d>\251]I\276\313\240,\276\333\'(>\361Z\324=g\240~=\223\347x\276\210\t\335=\316\236\244>\254\336+>\322\225\n\276I\231Q=1y%\276\256\204*\276\370\320\376=\203:\255\275(=(>\260%\302=U(\327=\242\360i=;9O\275\252m\302<\231\2707=z\307\177<\244\034z>\354\343K=\366w_\275\207\352\037>\220\243\214</\334\367=\371\363\313\275LC\204\273=M\030\275\240\271\013\276q\220\216=\177\016>>\221\033\022>\336\346K=\377D\362;w\264\004\275mrw>D?\013=\\\365=>\376e\225\275\311\013\257\275\377\212\347<\215^Q\275>\251\327=\310]K\274\253\337R\276FW\225\276\330\277\240=\323g\030>\257k\315\275F\331\201>b\252\345=\323\350T=\253h\232<\277\353\325=\366\2502\276\310z\243=\306/\010>\005\'\266\274\352\\v>\240O\031\274l\210M\276\002S\032\276\367b\320\275i\216\200=3\3129\274\244\225\233\2757\320\270=8\277\006>\304\341\274\275\303\326\376\274(\202]\275\375\231\247\275\350J\345\275\340i\317\274\273a@>{@\033\276D\330Q>v\005\302\275\376\315N\274\270\350\260<\023b\342\274v\260y>u\345i\275\346\306\221>\337\234\257\275\270\233\032>dg\226\2748\004\212>\353~>>\366\227\017\276\334\3543\27613\207=q\227[>\342\243$>\024\255k=\341\327a>\347\013\002=\226\352\037<Qn(\275L\340\247\274\344\3028<\316\026\021\273w\331U\275\260\307\335=\241-.<\230i\001=^r\032>\324\031Q>\322\206o<A\237\366\275\261\204\327\274\210S\374\275\014\313a\275\236\232\207\275\316\222\245>\177\0374\275T~V>\233z\230=\206U\231\275\021\315\242\274\241\013\337\275\367\223\351\275\335!\245\276\375\260\207=_\347#\276l\000\021\276\023*\320=B\265\\\276\271\256q=k\"z<\236qD=\222y\223\275q\341\347\275\324\330\245=w\365\267\275\266\300\005>\n\217i>X\262M=\342\205\257\275\2405<=6\n\035\276\302\343\266;v2\315=\353g\304\273\225\262@>n\335\034=r\314\215\275\330pW\276at{\275N\347\251\275\210\n\234\276]\301R\273~\033B=!EV>N]\002=\315\335Z\275\331_\315=\231\263W>\2053g\275q-N=\211\037\241\276\361\373e=.\217\027\276R@\203\276k\344\376\274N\266\r<\350\264\026\275\352\031\023\275\014\021\177\276\031Oe=\343M\005>)-\267=\253I\375=\013\270\323\274!\3532>\370\222:\276\377U6=\342/\014>\234l\377;\356\336\275=!\0366\276\361\370\221\276\335\r\261=\305\333x\275\363X\223<Z\264\273=9-\341=!<\004\276<\265\305=\347\035\237<\\Xn\275\314,/\275?\347\211>\316\264,\276\366\344b=z_\336\275\035\332\231<\"y\213\273\302\340\033<\324\233\361\275\224A\026>\3331\225<=g\201\274\025m\022\275\253<=\2743\301\331\275_A\266=\030\241\201\276\342E\257=T\300\017\2766X\267\274\343\220\261<\211\257\201\276\260u\215>\216\270o>L&\316=S1\374=,{\231\275:-\004>\272\023\224\275+\214y\275\331\310\205=\200\230P=zO\340<G|G>\234\351\273=-\307\026\274n\305\\\275\310\323\202>SJ\203\275\t\345\350=\273\314\002>\3619u\276\204\310&\274\335;\305\275\3643\026=H\246I=2D\'=\257\273\271\274\305f$>\024FW\275^\250f\276\306\177\006<n\245I\275\226\315\374\275\207!W\276\303\005d\276\317\017\221>\226\203{\275\0015\246\275@\272\204\275O\305/>\347(\243\275\200r\002>\302\337\202\273\340\337\033\275/E:>\340\037n=\273o\310;C.\353\274\370&\316=\303%\215\275#@\337\275F\267\233=\267\311\004>g45\275w\361\021\274\375\213T>w5\204\2754\360\200\276\232h\210<J$\001=\333\262\243\275H2\356\275xj,\275\276\242 >\005O\004>\27582>;\327p\276Rw#\275\2030\013\276\344\365\037\2768@\317\275\341^\001\276\021+\021>\364h2>;\006]<\342\313\030>\355,\312=\033\366\350=\250\347p\275\320\014\334<\364\233;\276\027\"\036\276\245c\227\274\336\332\207\275\271\323A\276\250\300\000>D\023/>\301\3427\276\215\302\277\273\221\273\245=v\314k=\245#\374\275\347\007\241\276\027b\022>5m\307=\363\325\346=\301\031\226\2750\025\265<e\376}=\204J\213=:n\032=\030\200\326\275@\240\230\275}\307\275\272\377\226Y\2761\327\343=\214yU>#\364M=\022\353\203\275\025t\317\275\267\377\034\276\237uZ>\347\344\027=T\035\204=\3757H\275\274\346\031\276\217\306\203\275\341\243\326<yU\362=L\274\243\274\355\316\\>>E\246\275w[]=`R\375\275Xfn=l?\356\274+jp>\256s <\177w\233\275p\264\205\275\004\022\270<#\016e\276\203(\033\276 Q\210=s\010\262<^\021\342=\350\332\024>,R\302\273lW\230\275l2o>$A\266\275\026\254\214\276\330%\004\273\242j\226<\257u\'>\372i\376\2758q\242=]\177\"\276A<\034\275\325\rH\275\002\367\014=\000\231]\275\343\001\277=u\306\230=r\236\217=D\351\203\274\204 r=\n|\336\276{\305\264=\037H\235\275\\?e\275X\215\r=T.\351\275\317\246\257>m9\300\275\274\271\366=\264\377\224\275\267\224\000\275e\225\226=\rcZ>\301\313\311<_M\246=\021\354\'>~e(\275\032\364q=\314\256\230\275a\317\224\275\023!\306=\323\320f\2762M\031\276\374\257\250\274\352,\367=\206\333@\276.\020\r=\317\212_>0\264\201\274\351\304!>\363\231\206>O\004\313\275\030\016\320<\275AM=\3359\202=\034\\^=Q%\222\275\346\354\345\2755\272\332\273\202\215\274\275\354\2222>\272+\354=D\216\364\274%\010\372=r\272\342\275X\332\020\276\255@\332=W0\304<\343\364^\276\231\333\034\276\213\3014<X}8=F\003\340=\231$\200<\261\322)=\313\225\242\276\333\016\251\275s\274\371\275\344Z\365\275\t\302\340\273\013\022\016\276O \010\276\201\001\013=\323\372\243<\016@\024\276\302t\024\276Z\375\234=\207n\026\275\341\332\205\276 \020\253=\356o\222>\020[]\276*\277_==\333\207\275x\216]=L\235\367=\003\264\330=&\375\333\275\321\317\262=\254\252\347\273Pp\303\275\267\0348\275#\004\236=\021\375O=\002\234\236=e\215(\276He~>\210I\374\274\236\214\317\275\320\362\207>\357\313\013>\205_\201=\205\352\257=\274\265\325\275\374T\206=\337%\033>\203\264\365\275\tk\232=D>$=\2420\t>\376\0050\276\031\233,<\345\366Q>I\237\246>BL\335=\335\203\301\274\211\327f\276\037@\027\276I84\274,\0309\275-\234\243\276+U\270\275\200)\337\2748\r\271\275\204\022\226=\325M\023>\3466\372=\301\200$\276N\002\254=\365X\316\275\002\013i\274-\234O\276\002\226N=!t\017>\337/\205\274\227\232\300\275\0257\033\276yc\267\275\024\010\207>m#\003\275\214@\222<C\274\004=\023\356\033>\3702\302<\n\370\373=\250C\006\275\313x\263\274\234\013\213\275,\334\342=Z\361\325<Gc >\375\0066\275c\321\245\275\2759\206\276\234\274\024\274\202=\221<S\241\312\2733\005\235\275G\177/\276z\031\375<\277\311)\276_\002\324\275\275\005\005\276\206\225K\276\351\321\223;\306\005\221\276\345\243\243\275\207\257\314=2\271R>\250\365\220\275\250n}\276\261\203\350=1\315\000>;\350\250\275\315T\252\274\343\202\024\275z\035b>/\027\004\276Fh;=M\376/\275\226\354\240=:\210%<S\302\200\275\310\343D\276\266L=\274\232\235\311\275\315\354\210>\017L\006\276\212\314\313\275\237\330\275<K\200\353\275\300\352C\276\230\337C<;\273$>\320m\325=t\200\217>\373\336\241\274\235\\0\276\022T\377\275P\347\222\275\320o\334\275\230\023\313\275$\030\300\275\316\234N<`r\315=\207[,>\n\277\201\272d\312\016\275\356\342\302\275BI\242\276H\001\340=\306\337F\274\030RD\275`2;>\\\374%>\355l/\274\004\324\313;:X|\276\214{=>%#\350\275\257\2402\276>\352\032\276\314WJ>[\202H<\275\"\304>\354\211\321\274+\313\243=l\231\017=`\352\236=b{\212=\304\336\206\276\250j8\275B\310G\2752\326\033>\341B\231\276*T\014\276\"\341G<\347\205\253=\035\345\257\275{.\037=\361\204\270\275\255\027\033>V\351\026\276-\201\270<\033\215#\276Q\004r\275Hh\236;\353\206\326=\014\265\n>\307\321\267=\317H0>j\220\234\275\275\261\031>8\231\324<\344\252\323:$\036\016\274\271 \370=\325`;\275@jc\275\346\035B\275L\331q\274\213E\000=2\214\353\274Cak\275\323\351\251<\"o\244\275\334\234N=\377\277\356\275w\215\242=,y;\276C\360O\275Q\367Q\276+\210\242\275\257\177\270\2740\265\371=9\350\264\272\357O\345=#QD=\323\020\t\276\207;\261\275\310\003\207=\345U\014=~\246\234\276\317B\215\275E\365\236<\340\212\242\275~\371\014>\013\010\272=H\201W>\227nk=\032s\021=4\376\330\276\266\005\013\274\223\343\271=\017\205]>\254\014\016\276\377B\031=i\310\215\275)\210U=N\222\326\275\311\306\256\275\317\374\375\274\225\204G\276u\230\221>\205y\302=\307\346O>\367\322.\276\241\236\031\273\343\003\017\275\331$T\275a\301\371\275\241T\t\275!\007\222<\251\243\023\275\230\312b\275C\312/>\320\255@>\351\272\310=\3554\360\275{\207_=\343\247\336;\231\360\346=(\006\237\275\027P\006\276\335\252\022\276.L\377\274\267\356\315=\235\317k\275w\352\007\274\035\234\001>\365\240o<\342\304[\275O\360n=\237\321\037=\026!\030>m1\252=\267QN\276\324\265}>E\225\240\275\2260\252=\216\277\307=k\311\356\275|~\243\275\r\006\312=\345l\362=\211S\240=\225\265\205\276\265%\033>T\272\022>1(\266\275\010\227$\275\251\373r\276\'\376\026\276\037d\004\276\245b3=\352\025\324\275\353\275\224=\312\026\270\275\036\030#\276\017\tg>\\\227\311\275\272\314\251=\274\233F\276\022C\034>\217\250\034<\353\277\036\276<eI>\203\241e\275\312\037\234\275\346\224\354\274\247\345f>\224\214\300\275\035\271\340\275i\307\000\276\353\237\274=\377\273z\276\033\002\364\274;\210`\275\001X$<[&\222\275\225!<\276\350h5=\342\370\221\274=.#>>\311\274=\206\315\354\275*%\n\275\332\214o>\361\254~>\353\274k>_>T>\030\305\354\275\253IJ=\007\207\\\275\343\204\t>\271\001}>\325\275b=\235\224\202;h \333\275\034\2558\276\343\224Z>^V\306\275\374\244;\275\033\2678\275\214\200\367=KR.=\230\206\340\275M\035\002\276g\034E\275\034\343\005>;\335\'>N\362!>\342\206\377\274\324\2163>P_L\275t\336\272<\236v\305\275\234\004U\273\031\313\352\275\257\203\017>\326\032\220=\013>.=\026\275\223\274I.\031\275\267:\013>\2256\014>\251\305\201>\177\021\003\274\370\270Q>T\340\327=\316`\305\275\203s\251>\226\265\362=7\315h=g\355h\275\n\315\277<x\224p>S\r\030<\271V\307\275&\225\360\275\273:W\275tW\316=\373\256\023\275\363\036\372\275\362\030\016>\227\365\304\275\375:\030\274\'\367\242\275x8\322;\r\347g<o77>.\205M>\013&\003>\355)\217\2755\276y=6\241\265\275R\360\034\276\373~\207\276\355T\332\275d\016\244\275\244%\204>/\020\004\276\243\210\003\276V\333\211\275\357{,>?O\220>O\276\004=\312\334\263=\224V\004>\214s\316\275_\204b\275+\022\013\276h\253\272\274V\021\274;\253\261Y\275+1\351\274\273 \254\274\373\363\253\275\\^\036\275\302\342\326\275\325I\221>\275\203\214\276\355td\275\247\245\326<\272\265*\2768\244\245\275w\027\337\275\273\264\t>\001\356|=z\227\006\276\340F\222\275\332\311\020>P\230\213\276eF\241=\246\252\241<\355Q\006\274\373\351\005\276\037.\251\275\013\204\272=\'\325V\275\311\330\303=\262\003\325;\321\216N>\343J\374\275\237\312\036<U\307#>Q\247\332\275\221\374\'\275\207\257\204\275mV\017\275I\030\021\2744\371\301\275\315\300x\276v\355\374\275\013\371f\275\024\227\177\276Esp\274\313n\267=\277\260\206\275\307=7\276\321\223 \276c\240\230;\334\327b>\270\003\347\274\373\350+>\371d\205=,?a=x\305\334\275!,f=K\330e<R\337J= \320\317<\225\276\316\275\341\353]\275]\311\332<W(h>\362\370\347=P\364\317\275\017\274o>\037\356\355;T\212\350\274\323\341\004\276\346\337\340\275O\273?>0&%\273uHC>\367\222\224>\022\345\300<T\303\267=/\245\356\275\2123C\276\020\303h<+i\270<\201\365D\276\313\223\013>\312Wr\2763\'D\275\024\242\355=\216u\027\276\304\025\252\275\326\260S\275zL0\276q3\221>\235\276\322<\313\034\222<m\007\324;e\023\236\2756\034\310\275\233\370\016=\220\306\030=\363\344I\276\001\271\226\276\234,\353=\2146Y\276\022\004\362\275\216\201\227>ux\326\274\240\206\r\275\030n\244:\257E\203=\032:\345\275\351\214\256\275`2w=\021qQ=\375\342\034\273\033)\177\276\222\312\217=\264\003\261=\241\343\013=\r\215\027>\324K\342\275\361\004\202<gc\363\274\326\327@>K,\241=\250\365}\275T\001\357\273\247\351\360\275D\232E;\306\234\035\275\357\211\000>\177i\277\275.\240+>\330\223\331=\372\005\332\275Ag.\275\303\350\227\275~\n8>\256\336\323=\270#\326=E\363\267<]\207\370\274\374\376D\2761,\r\275\276\031\271=W\361\353\275y\300\274<\245Z\250\275\226\344\302\275\323\025\\\275\345\202\303>k`\215=\376\352X>\351\331M>\364\016\017>\033k:\276\262S\265\274\005\332N=\323?\332\273$\035X=\336y\010\276\362\366\010;\233\001\274\275\232(\303=\023\000\010\275\360\247G\275\222\353\260\274\354\213\273\275\265P\204\276d\365\311\274L6\340\275\031M=\276,\236\006\276)YH=6\325\222\275\346w\314=4\201\263=*%\344\275\005\267\240\276\200\254O\274\201\331\035\275G\302\310\275\323\345u\275\252\337\004\276{Q\016\275\010\263\232\276_1{\276\264\2646>\334\214i=HH\264\274:5\272\274RX;\274\274\307\254\275\024<5\275\362\243\'>\225.\311<\347\346\204>\005\0331>\2373{;\r\325}\273\203\332W=\"\177C\276D7\305\275\323q\272\275\260R\301\275\230\354\364=\026<^\275\242\250\311=\201\216\225\273\337S\262\276\301Y\201>\227\210\027\276m\307\242\275t5\206\275\365\206\343=\021\227<=\214lX=\325\261\321<7\313W\276x[\325\272\222\233\221\275\232\247x<\025\307J>G\210/\276\256&\024\276\025\216\246=\034$e\274A\374\236\275\240>\301\275\023W\311\274\007\"?=\253\321\300<\305\304y\275Kz\317\274@\213\021>Y\353O\276\201,\257\275\217\035\304\275f\375\260<\251\331\370\274\275u\204=j\240\366=\205\223\274\275\345\360(\276\034X\223\274\253\032\036>\374\023F\276\276\035\035\2754\256\216\276\314\265\371;\325\377\221\276\025\032\005\276=/\216=!\2570>\007\302{<\240\362,\274\013K\322=W[k=bcJ\275H\224\364:/OU>5C.\276\245\270\360\275\217\n\326=\2609\330=\210\357\037\275\227\333\000>\350\240k>,\'\200\273\'\000\246=$=\004\274\201\036\350=4\247\035\275\377\2230\276z\331\304\275\036\013p>\377e]\275#\243\252\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "ClipByValue"
  input: "net/add_1"
  input: "net/Const_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "ClipByValue"
  input: "net/add_3"
  input: "net/Const_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
